
&НаКлиенте
 Процедура Результат(Команда)
	
	ТекущаяДатаСезона=ДатаНачалаНавигации;
	КоличествоТрески=0;
	КоличествоЛосось=0;
	КоличествоСельди=0;
	Пока НачалоДня(ТекущаяДатаСезона)<= НачалоДня(ДатаОкончанияНавигации)ИЛИ
		КоличествоСельди + КоличествоТрески+ КоличествоЛосось>0 Цикл 
		Если НачалоДня(ТекущаяДатаСезона)<=НачалоДня(ДатаОкончанияНавигации)Тогда
		Если ДеньНедели(ТекущаяДатаСезона)<>1 Тогда
		Если День(ТекущаяДатаСезона)%2=0 Тогда
	    КоличествоСельди=КоличествоСельди+40;
	Иначе КоличествоТрески=КоличествоТрески+64;
		КонецЕсли;
	Если День(ТекущаяДатаСезона)=15 Тогда
	 КоличествоЛосось=КоличествоЛосось+82;
 	КонецЕсли;
КонецЕсли;
КонецЕсли;

  	 		Если ДеньНедели(ТекущаяДатаСезона)=1 ИЛИ ДеньНедели(ТекущаяДатаСезона)=4 
			Тогда 
			Если КоличествоСельди-15>0 
			Тогда	КоличествоСельди=КоличествоСельди-15;
		ИначеЕсли КоличествоСельди>0 Тогда
			Сообщить("Склад сельдя пуст"+" "+ТекущаяДатаСезона);
			КоличествоСельди=0;
			КонецЕсли;
			
		ИначеЕсли ДеньНедели(ТекущаяДатаСезона)=2 ИЛИ ДеньНедели(ТекущаяДатаСезона)=5 
			Тогда 
			Если КоличествоТрески-18>0
			Тогда КоличествоТрески=КоличествоТрески-18;
		ИначеЕсли КоличествоТрески>0 Тогда
			Сообщить("Склад трески пуст"+" "+ТекущаяДатаСезона);
			КоличествоТрески=0;
			КонецЕсли;
		
		ИначеЕсли	ДеньНедели(ТекущаяДатаСезона)=3 Тогда 
			Если КоличествоТрески-10>0 
			Тогда КоличествоТрески=КоличествоТрески-10;
				ИначеЕсли КоличествоТрески>0 
			Тогда Сообщить("Склад трески пуст"+" "+ТекущаяДатаСезона);
			КоличествоТрески=0;
		КонецЕсли;
		Если КоличествоСельди-10>0
			Тогда КоличествоСельди=КоличествоСельди-10;
		ИначеЕсли КоличествоСельди>0 Тогда
		Сообщить("Склад сельди пуст"+" "+ТекущаяДатаСезона);
		КоличествоСельди=0;
	КонецЕсли;
	
		ИначеЕсли	ДеньНедели(ТекущаяДатаСезона)=6 ИЛИ ДеньНедели(ТекущаяДатаСезона)=7 
  		Тогда 
  		Если КоличествоЛосось-5>0 
		Тогда КоличествоЛосось=КоличествоЛосось-5;
	ИначеЕсли КоличествоЛосось>0 Тогда 
		КоличествоЛосось=0;
		Сообщить("Склад лосося пуст"+" "+ТекущаяДатаСезона);
		КонецЕсли 
	КонецЕсли;
	Если НачалоДня(ТекущаяДатаСезона)=НачалоДня(ДатаОкончанияНавигации)Тогда
		Сельдь=КоличествоСельди;
		Лосось=КоличествоЛосось; 
		Треска=КоличествоТрески;
	КонецЕсли;	

	
		ТекущаяДатаСезона=ТекущаяДатаСезона +(24*60*60);
		
		КонецЦикла;       
			
		КонецПроцедуры
         //git